{
    "1.10.1": {
        "url": "https://github.com/stawen/okovision/archive/1.10.1.zip",
        "date": "06/12/2020",
        "changelog": "<ul><li>Make Okovision International by adding English language (default)</li><li>For changing Language, go to parameters menu</li><li>This is the last update for the coming months !</li><li>Next version will be Okovision V2</li></ul>"
    },
    "1.11.2": {
        "url": "https://github.com/Domotrique/okovision_2023/archive/1.11.2.zip",
        "date": "27/10/2023",
        "changelog": "<ul><li>Update with PHP 8 Compatibility, including install steps for Linux (Raspbian 12)</li><li>Add Bug fix for 0 degres issue when Boiler gets turned off.</li></ul>"
    },
    "1.12.1": {
        "url": "https://github.com/Domotrique/okovision_2023/archive/1.12.1.zip",
        "date": "24/11/2023",
        "changelog": "<ul><li>Reactivate auto update functionality by redirecting to this repository</li><li>Updates Highstock to latest version.</li><li>Fix mobile scrolling bug onto graphs.</li><li>Fix a bug preventing some data to be displayed in real time mode.</li><li>Made install easier with new script for Linux and filling in some standard info in the setup (database path and login)</li></ul>"
    },
    "1.12.4": {
        "url": "https://github.com/Domotrique/okovision_2023/archive/1.12.4.zip",
        "date": "08/02/2024",
        "changelog": "<ul><li>Fix the bugged values issue when the heater gets shutdown.</li><li>Implement a new page for generating SQL dumps of the database (Parameters > Import/Export SQL Base).</li><li>Importing another SQL dump file is not possible through Okovision_2023 yet for security reasons, you might want to do it in command line mode.</li><li>Improve text visibility in history tab (police was too small.</li></ul>"
    },
    "1.12.5": {
        "url": "https://github.com/Domotrique/okovision_2023/archive/1.12.5.zip",
        "date": "22/02/2024",
        "changelog": "<ul><li>Update setup and parameters pages.</li><li>Fix bug on SQL backup page preventing from generating a dump.</li></ul>"
    },
    "1.12.6": {
        "url": "https://github.com/Domotrique/okovision_2023/archive/1.12.6.zip",
        "date": "22/04/2024",
        "changelog": "<ul><li>Add 'running' icon for the dump generation.</li><li>Fix bug in setup page which prevented from saving new values.</li></ul>"
    },
    "1.12.7": {
        "url": "https://github.com/Domotrique/okovision_2023/archive/1.12.7.zip",
        "date": "24/09/2025",
        "changelog": "<ul><li>Fix a bug preventing the system to update when a file was empty on the heater logs.</li></ul>"
    },
    "1.13.0": {
        "url": "https://github.com/Domotrique/okovision_2023/archive/1.13.0.zip",
        "date": "04/11/2025",
        "changelog": "<ul><li>Devlopper comment: I fixed several issues and added an analytics functionality. The purpose is to get anonymous information to know the number of installations.⚠️ You can disable the analytics, but this helps me understand if I need to spend time improving the tool for other people.Thank you all for your support.</li><li>Add Statistics to improve Okovision. This functionality will send anonymous data to an API, including : Random Installation ID, Okovision version, PHP version, date of registration, last alive date. You can disable this functionality and delete your installation id in the parameter page.</li><li>Improve some texts for more clarity</li><li>Fixed an issue causing an error on installations without Hot water.</li><li>Improve password change that wasn't asking for the old password (will update the password encryption for the next update)</li><li>Add some new fields into the config.php</li><li>Improve install process for Linux systems to make sure all packages are properly installed</li><li>Automatic reset DEBUG to false during the update in case people forgot.</li><li>Remove obsolete ZIP calls to new PHP 8 versions (make sure to update to PHP 8.0 minimum).</li></ul>"
    }
}
